run: |
  esc env init test
  esc env set test foo.bar.baz qux && esc env get test
  esc env set test foo.bar.alpha zed && esc env get test
  esc env set test 'foo.beta[0]' gamma && esc env get test
  esc env set test 'foo.beta[1]' 42 && esc env get test
  esc env set test open '{"fn::open::test": "esc"}' && esc env get test
  esc env set test 'open["fn::open::test"]' cse && esc env get test
  esc env set test array '[hello, world]' && esc env get test
  esc env set test 'array[1]' esc && esc env get test
  esc env set test 'array[2]' '{}' && esc env get test
  esc env set test 'array[2].foo' bar && esc env get test
  esc env init test2
  esc env set test 'imports[0]' test2 && esc env get test
  esc env init test3
  esc env set test 'imports[1]' test3 && esc env get test
stdout: |+
  > esc env init test
  > esc env set test foo.bar.baz qux
  > esc env get test
  # Value
  ```json
  {
    "foo": {
      "bar": {
        "baz": "qux"
      }
    }
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux

  ```

  > esc env set test foo.bar.alpha zed
  > esc env get test
  # Value
  ```json
  {
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      }
    }
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed

  ```

  > esc env set test foo.beta[0] gamma
  > esc env get test
  # Value
  ```json
  {
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma"
      ]
    }
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma

  ```

  > esc env set test foo.beta[1] 42
  > esc env get test
  # Value
  ```json
  {
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    }
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42

  ```

  > esc env set test open {"fn::open::test": "esc"}
  > esc env get test
  # Value
  ```json
  {
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "esc"

  ```

  > esc env set test open["fn::open::test"] cse
  > esc env get test
  # Value
  ```json
  {
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"

  ```

  > esc env set test array [hello, world]
  > esc env get test
  # Value
  ```json
  {
    "array": [
      "hello",
      "world"
    ],
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"
    array:
      - hello
      - world

  ```

  > esc env set test array[1] esc
  > esc env get test
  # Value
  ```json
  {
    "array": [
      "hello",
      "esc"
    ],
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"
    array:
      - hello
      - esc

  ```

  > esc env set test array[2] {}
  > esc env get test
  # Value
  ```json
  {
    "array": [
      "hello",
      "esc",
      {}
    ],
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"
    array:
      - hello
      - esc
      - {}

  ```

  > esc env set test array[2].foo bar
  > esc env get test
  # Value
  ```json
  {
    "array": [
      "hello",
      "esc",
      {
        "foo": "bar"
      }
    ],
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"
    array:
      - hello
      - esc
      - {foo: bar}

  ```

  > esc env init test2
  > esc env set test imports[0] test2
  > esc env get test
  # Value
  ```json
  {
    "array": [
      "hello",
      "esc",
      {
        "foo": "bar"
      }
    ],
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"
    array:
      - hello
      - esc
      - {foo: bar}
  imports:
    - test2

  ```

  > esc env init test3
  > esc env set test imports[1] test3
  > esc env get test
  # Value
  ```json
  {
    "array": [
      "hello",
      "esc",
      {
        "foo": "bar"
      }
    ],
    "foo": {
      "bar": {
        "alpha": "zed",
        "baz": "qux"
      },
      "beta": [
        "gamma",
        42
      ]
    },
    "open": "[unknown]"
  }
  ```
  # Definition
  ```yaml
  values:
    foo:
      bar:
        baz: qux
        alpha: zed
      beta:
        - gamma
        - 42
    open:
      "fn::open::test": "cse"
    array:
      - hello
      - esc
      - {foo: bar}
  imports:
    - test2
    - test3

  ```

stderr: |
  > esc env init test
  > esc env set test foo.bar.baz qux
  > esc env get test
  > esc env set test foo.bar.alpha zed
  > esc env get test
  > esc env set test foo.beta[0] gamma
  > esc env get test
  > esc env set test foo.beta[1] 42
  > esc env get test
  > esc env set test open {"fn::open::test": "esc"}
  > esc env get test
  > esc env set test open["fn::open::test"] cse
  > esc env get test
  > esc env set test array [hello, world]
  > esc env get test
  > esc env set test array[1] esc
  > esc env get test
  > esc env set test array[2] {}
  > esc env get test
  > esc env set test array[2].foo bar
  > esc env get test
  > esc env init test2
  > esc env set test imports[0] test2
  > esc env get test
  > esc env init test3
  > esc env set test imports[1] test3
  > esc env get test
