run: |
  esc env init test
  esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= || echo OK
  esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= --secret
  esc env get test
  esc env get test password
  esc env get test --show-secrets
  esc env get test password --show-secrets
  esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= --plaintext
  esc env get test
  esc env set test password 1234 --secret
  esc env get test
  esc env set test password 123.4 --secret
  esc env get test
  esc env set test password false --secret
  esc env get test
  esc env set test password true --secret
  esc env get test
  esc env set test password '[]' --secret || echo OK
stdout: |
  > esc env init test
  Environment created: test-user/default/test
  > esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M=
  OK
  > esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= --secret
  > esc env get test
  # Value
  ```json
  {
    "password": "[secret]"
  }
  ```
  # Definition
  ```yaml
  values:
    password:
      fn::secret:
        ciphertext: ZXNjeAAAAAHZzcjk7+e21uvV8eLW07XkwcXy+Nflzfm4s/K0yOXC5c7S5MX11cb3y7PNve6n0kM=

  ```

  > esc env get test password
  # Value
  ```json
  "[secret]"
  ```
  # Definition
  ```yaml
  fn::secret:
    ciphertext: ZXNjeAAAAAHZzcjk7+e21uvV8eLW07XkwcXy+Nflzfm4s/K0yOXC5c7S5MX11cb3y7PNve6n0kM=

  ```

  # Defined at
  - test:3:5

  > esc env get test --show-secrets
  # Value
  ```json
  {
    "password": "YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M="
  }
  ```
  # Definition
  ```yaml
  values:
    password:
      fn::secret: YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M=

  ```

  > esc env get test password --show-secrets
  # Value
  ```json
  "YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M="
  ```
  # Definition
  ```yaml
  fn::secret: YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M=

  ```

  # Defined at
  - test:3:5

  > esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= --plaintext
  > esc env get test
  # Value
  ```json
  {
    "password": "YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M="
  }
  ```
  # Definition
  ```yaml
  values:
    password: YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M=

  ```

  > esc env set test password 1234 --secret
  > esc env get test
  # Value
  ```json
  {
    "password": "[secret]"
  }
  ```
  # Definition
  ```yaml
  values:
    password:
      fn::secret:
        ciphertext: ZXNjeAAAAAGxsrO0gN+X5A==

  ```

  > esc env set test password 123.4 --secret
  > esc env get test
  # Value
  ```json
  {
    "password": "[secret]"
  }
  ```
  # Definition
  ```yaml
  values:
    password:
      fn::secret:
        ciphertext: ZXNjeAAAAAGxsrOutAnEmzU=

  ```

  > esc env set test password false --secret
  > esc env get test
  # Value
  ```json
  {
    "password": "[secret]"
  }
  ```
  # Definition
  ```yaml
  values:
    password:
      fn::secret:
        ciphertext: ZXNjeAAAAAHm4ezz5S7WA1Q=

  ```

  > esc env set test password true --secret
  > esc env get test
  # Value
  ```json
  {
    "password": "[secret]"
  }
  ```
  # Definition
  ```yaml
  values:
    password:
      fn::secret:
        ciphertext: ZXNjeAAAAAH08vXl5sA7yg==

  ```

  > esc env set test password [] --secret
stderr: |
  > esc env init test
  > esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M=
  Error: value looks like a secret; rerun with --secret to mark it as such, or --plaintext if you meant to leave it as plaintext
  > esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= --secret
  > esc env get test
  > esc env get test password
  > esc env get test --show-secrets
  > esc env get test password --show-secrets
  > esc env set test password YMHdog6VkUqbVS5dAErxWeMy83r4HeBeNRdEuUFwK3M= --plaintext
  > esc env get test
  > esc env set test password 1234 --secret
  > esc env get test
  > esc env set test password 123.4 --secret
  > esc env get test
  > esc env set test password false --secret
  > esc env get test
  > esc env set test password true --secret
  > esc env get test
  > esc env set test password [] --secret
  test:3:21: secret values must be string literals
